Revit 2027 API
FabricationItemFile.GetImage Method
Gets the image for the fabrication item file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Bitmap GetImage()
Public Overridable Function GetImage As Bitmap
public:
virtual Bitmap^ GetImage()
abstract GetImage : unit -> Bitmap
override GetImage : unit -> Bitmap
Return Value
Bitmap
System.Drawing.Bitmap represents the fabrication item file image. null if there is no preview image.
See Also
Reference
FabricationItemFile Class
Autodesk.Revit.DB Namespace